leila_haghdoost/week_05/flower-search/app/views/gardens/show.html.erb

<ul>
<% @garden.flowers.each do |flower| %>
---
SELECT "flowers".* FROM "flowers" WHERE "flowers"."garden_id" = ?  [["garden_id", 1]]