leila_haghdoost/week_05/flower-search/app/controllers/flowers_controller.rb

  def create
    Flower.create flower_params
---
INSERT INTO "flowers" ("name", "image", "blooms_in", "features", "garden_id") VALUES (?, ?, ?, ?, ?)

  def index
    @flowers= Flower.all
---
SELECT "flowers".* FROM "flowers"

  def show
    @flower = Flower.find params[:id]
---
SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def edit
    @flower = Flower.find params[:id]
---
SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    flower = Flower.find params[:id]
    flower.update(
    name: params[:name],
    image: params[:image],
    height_feet: params[:height_feet],
    blooms_in: params[:blooms_in],
    features: params[:features]
    )
---
SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "flowers" SET "height_feet" = ?, "blooms_in" = ?, "features" = ? WHERE "flowers"."id" = ?  [["height_feet", 5.0], ["blooms_in", "Mid Spring - Mid‑Fall"], ["features", "Deer resistant"], ["id", 1]]

  def delete
    flower = Flower.find params[:id]
    flower.delete
---
SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "flowers" WHERE "flowers"."id" = ?  [["id", 13]]