leila_haghdoost/week_05/flower-search/app/controllers/gardens_controller.rb

SELECT "gardens".* FROM "gardens"
---
def index
  @gardens = Garden.all

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
  @garden = Garden.find params[ :id ]

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def edit
  @garden = Garden.find params[ :id ]

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gardens" SET "image" = ?, "updated_at" = ? WHERE "gardens"."id" = ?  [["image", "https://a.travel-assets.com/findyours-php/viewfinder/images/res60/169000/169605-Dr-Sun-Yat-Sen-Classical-Chinese-Garden.jpg"], ["updated_at", "2018-10-10 12:12:29.159716"], ["id", 2]]
---
def update
@garden = Garden.find params[ :id ]
@garden.update garden_params

SELECT  "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "gardens" WHERE "gardens"."id" = ?  [["id", 5]]
---
def destroy


  garden = Garden.find params[:id]
  garden.destroy