leila_haghdoost/week_05/flower-search/app/views/flowers/_form.html.erb

  <%= f.label :garden_id, 'Garden' %>
  <%= f.collection_select :garden_id, Garden.all, :id, :title, prompt: 'Please choose the garden'  %> <!--???-->
---
SELECT "gardens".* FROM "gardens"